Repository: Abylai07/flutter_rent_scooter
Catalog: apps/mobile-shared/assets/l10n/intl_*.arb
Languages: kk, ru

# language
source: English
kk: Қазақша
ru: Русский

# enter_phone_number
source: Enter your phone number
kk: Телефон нөмірін енгізіңіз
ru: Введите номер телефона

source: Phone number
kk: Телефон нөмірі
ru: Номер телефона

source: Next
kk: Келесі
ru: Далее

source: Start ride
kk: Жол жүруді бастау
ru: Начать поездку

source: Get code
kk: Кодты алу
ru: Получить код

# resend_code_in
source: Resend code in 00:{seconds}
kk: Кодты қайта жіберу: 00:{seconds}
ru: Отправить код через 00:{seconds}

# onboadring_0_title
source: Welcome to Almaty Bike
kk: Almaty Bike-қа қош келдіңіз
ru: Добро пожаловать в Almaty Bike

# onboadring_0_description_0
source: A fast, convenient and eco-friendly way to get around!
kk: Жылдам, ыңғайлы және экологиялық қозғалыс тәсілі!
ru: Быстрый, удобный и экологичный способ передвижения!

# onboadring_0_description_1
source: Unlock a bike in a couple of clicks and enjoy your ride
kk: Велосипедті бірнеше басуда ашып, сапарыңыздан ләззат алыңыз
ru: Разблокируйте велосипед в пару кликов и наслаждайтесь поездкой

# onboadring_0_description_2
source: Follow safety rules and traffic regulations
kk: Қауіпсіздік ережелері мен ЖҚЕ сақтаңыз
ru: Соблюдайте правила безопасности и ПДД

# onboadring_1_title
source: How to start your ride?
kk: Жол жүруді қалай бастауға болады?
ru: Как начать поездку?

# onboadring_1_description_0
source: Find the nearest e-bike on the map
kk: Картадан ең жақын электровелосипедті табыңыз
ru: Найдите ближайший электробайк на карте

# onboadring_1_description_1
source: Scan the QR code to unlock
kk: Ашу үшін QR-кодты сканерлеңіз
ru: Отсканируйте QR-код для разблокировки

# onboadring_1_description_2
source: Enjoy your ride and follow the rules
kk: Сапарыңыздан ләззат алыңыз және ережелерді сақтаңыз
ru: Наслаждайтесь поездкой и соблюдайте правила

# onboadring_1_description_3
source: End the rental by parking the bike in an allowed area
kk: Жалға алуды рұқсат етілген жерде аяқтаңыз
ru: Завершите аренду, припарковав велосипед в разрешённом месте

# onboadring_2_title
source: Basic traffic rules
kk: Негізгі жол қозғалысы ережелері
ru: Основные правила дорожного движения

# onboadring_2_description_0
source: Keep to the right side of the road
kk: Жолдың оң жағымен жүріңіз
ru: Держитесь правой стороны дороги

# onboadring_2_description_1
source: Give way to pedestrians at crossings
kk: Өтпе жолдарда жаяу жүргіншілерге жол беріңіз
ru: Уступайте пешеходам на переходах

# onboadring_2_description_2
source: Do not ride on sidewalks
kk: Тротуармен жүрмеңіз
ru: Не ездите по тротуарам

# onboadring_2_description_3
source: Do not use your phone while riding
kk: Қозғалыс кезінде телефон қолданбаңыз
ru: Не пользуйтесь телефоном во время движения

# onboadring_3_title
source: Ending the ride and penalties
kk: Жалға алуды аяқтау және айыппұлдар
ru: Завершение аренды и штрафы

# onboadring_3_description_0
source: Park only in designated areas
kk: Рұқсат етілген аймақтарда тоқтаңыз
ru: Паркуйтесь в разрешённых зонах

# onboadring_3_description_1
source: Do not block pedestrian paths
kk: Жаяу жүргінші жолдарын жаппаңыз
ru: Не блокируйте пешеходные дорожки

# onboadring_3_description_2
source: Leaving the bike in a wrong place → fine
kk: Велосипедті рұқсат етілмеген жерде қалдыру → айыппұл
ru: Оставленный в неположенном месте велосипед → штраф

# onboadring_3_description_3
source: Damaging the bike → fine
kk: Велосипедке зақым келтіру → айыппұл
ru: Повреждение велосипеда → штраф

# incorrect_phone
source: Incorrect number
kk: Телефон нөмірі қате
ru: Неверный номер

source: Incorrect code
kk: Код қате
ru: Неверный код

# enter_code_from_sms
source: Enter the code from SMS
kk: SMS арқылы келген кодты енгізіңіз
ru: Введите код из SMS

source: Authorization
kk: Авторизация
ru: Авторизация

# setPasscodeTitle
source: To use Face ID/Touch ID, you need to set a passcode. Would you like to set one?
kk: Face ID/Touch ID қолдану үшін құпия код орнату қажет. Құпия код орнатқыңыз келе ме?
ru: Для использования Face ID/Touch ID необходимо установить код доступа. Желаете установить?

source: Yes
kk: Иә
ru: Да

source: No
kk: Жоқ
ru: Нет

source: Set Passcode
kk: Құпия код орнату
ru: Установить код доступа

# enterPasscode
source: Create a passcode
kk: Құпия код ойлап табыңыз
ru: Придумайте код доступа

# repeatPasscode
source: Repeat the passcode
kk: Құпия кодты қайталаңыз
ru: Повторите код доступа

# enableTouchId
source: Allow using Touch ID for quick login?
kk: Қосымшаны жылдам ашу үшін Touch ID пайдалануға рұқсат ету?
ru: Разрешить использовать Touch ID для быстрого входа в приложение?

# enableFaceId
source: Allow using Face ID for quick login?
kk: Қосымшаны жылдам ашу үшін Face ID пайдалануға рұқсат ету?
ru: Разрешить использовать Face ID для быстрого входа в приложение?

# inputPasscode
source: Enter passcode
kk: Құпия кодты енгізіңіз
ru: Введите код доступа

# rememberedCode
source: I remembered the code
kk: Құпия код есіме түсті
ru: Вспомнил код

source: Forgot passcode?
kk: Құпия кодты ұмыттыңыз ба?
ru: Забыли код доступа?

# biometricPrompt
source: Scan your fingerprint (or face) for authentication
kk: Аутентификация үшін саусақ ізіңізді (немесе бетіңізді) сканерлеңіз
ru: Отсканируйте отпечаток пальца (или лицо) для аутентификации

# error
source: An error occurred
kk: Қате пайда болды
ru: Произошла ошибка

source: Profile
kk: Профиль
ru: Профиль

source: Enter number manually
kk: Нөмірді қолмен енгізу
ru: Ввести номер вручную

source: Enter bike number
kk: Велосипед нөмірін енгізіңіз
ru: Введите номер велосипеда

source: Number
kk: Нөмір
ru: Номер

# booking_notice
source: Booking will be active for 10 minutes, after which it will be cancelled
kk: Бронь 10 минутқа дейін белсенді болады, осы уақыт өткеннен кейін ол жойылады
ru: Бронирование будет активно в течении 10 минут, по истечении этого времени бронь отменяется

source: Cancel
kk: Бас тарту
ru: Отменить

source: Book
kk: Брондау
ru: Забронировать

# inspect_transport
source: Inspect the transport for visible external damage. If you find anything, it's better to choose another vehicle
kk: Көлікті көрнекті сыртқы зақымдар үшін тексеріңіз. Егер ақау тапсаңыз, басқа көлікті таңдаған дұрыс
ru: Осмотрите транспорт на предмет заметных внешних повреждений. Если обнаружите что-то, лучше взять другой транспорт

source: Wallet
kk: Әмиян
ru: Кошелек

source: My transport
kk: Менің көлігім
ru: Мой транспорт

source: History
kk: Тарих
ru: История

source: Fines
kk: Айыппұлдар
ru: Штрафы

source: Security
kk: Қауіпсіздік
ru: Безопасность

source: Bank cards
kk: Банк карталары
ru: Банковские карты

source: Insurance
kk: Сақтандыру
ru: Страховка

source: How to rent
kk: Қалай жалға алуға болады
ru: Как взять в аренду

source: Training
kk: Оқу
ru: Обучение

# languageTitle
source: Language
kk: Тіл
ru: Язык

source: Support
kk: Қолдау
ru: Поддержка

source: Logout
kk: Шығу
ru: Выйти

# logout_confirmation
source: Are you sure you want to log out?
kk: Шынымен шығуды қалайсыз ба?
ru: Вы действительно хотите выйти из аккаунта?

# cancel_short
source: Cancel
kk: Бас тарту
ru: Отмена

source: Verification
kk: Тексеру
ru: Верификация

# step_num_of_3
source: Step {step} of 3
kk: {step}-қадам 3-тен
ru: Шаг {step} из 3

source: Enter data
kk: Мәліметтерді енгізіңіз
ru: Введите данные

# not_resident
source: I am not a resident of Kazakhstan
kk: Мен ҚР резиденті емеспін
ru: Я не резидент РК

# six_digit_code
source: Six-digit document code
kk: Құжаттың алты таңбалы коды
ru: Шестизначный код документа

# instructions
source: In Kaspi.kz or eGov, go to 'Digital Documents', select 'Identity Card', then tap 'Show Document' or 'Grant Access'
kk: Kaspi.kz немесе eGov қосымшасында 'Цифрлық құжаттар' бөліміне өтіп, 'Жеке куәлік'-ті таңдаңыз, сосын 'Құжатты көрсету' немесе 'Қолжетімділікті ашу' батырмасын басыңыз
ru: В Kaspi.kz или eGov, перейдите в раздел 'Цифровые документы', выберите 'Удостоверение личности', затем нажмите 'Предъявить документ' или 'Открыть доступ'

# check_personal_data
source: Check your personal data
kk: Жеке деректеріңізді тексеріңіз
ru: Проверьте ваши личные данные

source: Full name
kk: Аты-жөні
ru: ФИО

source: IIN
kk: ЖСН
ru: ИИН

source: Document number
kk: Құжат нөмірі
ru: Номер документа

# birth_date
source: Date of birth
kk: Туған күні
ru: Дата рождения

# birth_place
source: Place of birth
kk: Туған жері
ru: Место рождения

source: Nationality
kk: Ұлты
ru: Национальность

source: Issuing authority
kk: Құжатты берген орган
ru: Орган выдачи

# issue_expiry_date
source: Issue date - Expiry date
kk: Берілген күні - Жарамдылық мерзімі
ru: Дата выдачи - срок действия

# confirm_identity
source: Confirm your identity
kk: Жеке басыңызды растаңыз
ru: Подтвердите вашу личность

# face_control_instruction
source: Pass face control to complete verification
kk: Тексеруді аяқтау үшін бетіңізді сәйкестендіріңіз
ru: Пройдите face контроль для успешного завершения верификации

# no_objects_background
source: Make sure no people or objects block your face in the background
kk: Артқы жағында басқа адамдар мен бетіңізді жабатын заттар болмауы керек
ru: На фоне не должно быть других людей и предметов закрывающих ваше лицо

# start_verification
source: Proceed
kk: Бастау
ru: Пройти

# verification_in_progress
source: Verification in progress, please wait
kk: Тексеру жүріп жатыр, күтіңіз
ru: Идет проверка, подождите

# do_not_close
source: Do not close the app or lock the screen. Verification speed depends on internet quality
kk: Қосымшаны жаппаңыз және экранды бұғаттамаңыз. Тексеру жылдамдығы интернет сапасына байланысты
ru: Не закрывайте приложение и не блокируйте экран. Скорость проверки данных зависит от качества интернет связи

# verification_success
source: Verification completed successfully
kk: Тексеру сәтті аяқталды
ru: Верификация пройдена успешно

source: Verification failed
kk: Тексеру сәтсіз аяқталды
ru: Верификация не пройдена

# retry_verification
source: Please try again. Make sure the data is correct
kk: Қайталап көріңіз. Мәліметтердің дұрыс енгізілгеніне көз жеткізіңіз
ru: Пожалуйста, повторите попытку. Убедитесь, что данные правильно внесены

source: Try again
kk: Қайта өту
ru: Пройти заново

# face_control_failed
source: Face control failed. Please try again
kk: Face сәйкестендіру сәтсіз өтті. Қайталап көріңіз
ru: Face контроль не пройден. Пожалуйста, повторите попытку

# upload_passport
source: Upload passport page
kk: Паспорт бетін жүктеңіз
ru: Загрузите страницу паспорта

# scan_or_upload
source: Scan or upload passport
kk: Паспортты сканерлеңіз/жүктеңіз
ru: Отсканируйте/добавьте паспорт

source: Take photo
kk: Фото түсіру
ru: Сделать фото

source: Upload from phone
kk: Телефоннан жүктеу
ru: Загрузить с телефона

# photo_quality_requirement
source: The photo must be clear, not blurry, and without sunlight glare
kk: Фото анық, бұлдыр емес және күн сәулесі түсіп тұрмауы тиіс
ru: Фотография должна быть четкой, не размытой, без солнечных бликов

source: Retake
kk: Қайта түсіру
ru: Переснять

# faceIdLogin
source: Login with Face ID
kk: Face ID арқылы кіру
ru: Вход по Face ID

# touchIdLogin
source: Login with Touch ID
kk: Touch ID арқылы кіру
ru: Вход по Touch ID

# passcodeLogin
source: Login with passcode
kk: Құпия код арқылы кіру
ru: Вход по коду доступа

source: Change passcode
kk: Құпия кодты өзгерту
ru: Сменить код доступа

source: Change phone number
kk: Телефон нөмірін өзгерту
ru: Сменить номер телефона

# personalInfo
source: Personal information
kk: Жеке ақпарат
ru: Личная информация

source: Save
kk: Сақтау
ru: Сохранить

source: Delete account
kk: Аккаунтты өшіру
ru: Удалить аккаунт

# deleteAccountConfirmation
source: Are you sure you want to delete your account? Account data will be permanently deleted.
kk: Аккаунтыңызды өшіргіңіз келетініне сенімдісіз бе? Барлық деректер қайтымсыз жойылады.
ru: Вы действительно хотите удалить аккаунт? Данные аккаунта удалятся безвозвратно.

# confirmDelete
source: Delete
kk: Өшіру
ru: Удалить
